In [1]:
import pandas as pd

In [2]:
from numpy import NAN as NA

In [3]:
import numpy as np

In [4]:
import re

In [5]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [6]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned = data.dropna()

In [8]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna(how = 'all',axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA

In [12]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(how = 'all',axis = 'columns')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
import numpy as np
df = pd.DataFrame(np.random.rand(7,3))

In [15]:
df

          0         1         2
0  0.833315  0.191726  0.633921
1  0.748427  0.548196  0.057621
2  0.076918  0.779862  0.965276
3  0.561429  0.854052  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [16]:
df.iloc[:4,1] = NA

In [17]:
df.iloc[:2,2] = NA

In [18]:
df

          0         1         2
0  0.833315       NaN       NaN
1  0.748427       NaN       NaN
2  0.076918       NaN  0.965276
3  0.561429       NaN  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [19]:
df.dropna()

          0         1         2
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [20]:
df.dropna(thresh=2)

          0         1         2
2  0.076918       NaN  0.965276
3  0.561429       NaN  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [21]:
df

          0         1         2
0  0.833315       NaN       NaN
1  0.748427       NaN       NaN
2  0.076918       NaN  0.965276
3  0.561429       NaN  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [22]:
df.fillna(0)

          0         1         2
0  0.833315  0.000000  0.000000
1  0.748427  0.000000  0.000000
2  0.076918  0.000000  0.965276
3  0.561429  0.000000  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [23]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.833315  0.500000  0.000000
1  0.748427  0.500000  0.000000
2  0.076918  0.500000  0.965276
3  0.561429  0.500000  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [24]:
_ = df.fillna(0,inplace = True)

In [25]:
df

          0         1         2
0  0.833315  0.000000  0.000000
1  0.748427  0.000000  0.000000
2  0.076918  0.000000  0.965276
3  0.561429  0.000000  0.970507
4  0.385060  0.105781  0.212908
5  0.572508  0.797796  0.398108
6  0.788022  0.271964  0.620671

In [26]:
df = pd.DataFrame(np.random.randn(6,3))

In [27]:
df

          0         1         2
0 -1.064044  0.702611  1.044401
1 -1.942954  0.973792  0.763423
2 -0.650644  0.420381  0.908346
3  0.167938 -0.614560 -1.574405
4  0.314763  0.635489  0.609653
5 -1.893605  1.821080  3.292645

In [28]:
df.iloc[2:,1] = NA

In [29]:
df.iloc[4:,2] = NA

In [30]:
df

          0         1         2
0 -1.064044  0.702611  1.044401
1 -1.942954  0.973792  0.763423
2 -0.650644       NaN  0.908346
3  0.167938       NaN -1.574405
4  0.314763       NaN       NaN
5 -1.893605       NaN       NaN

In [31]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.064044  0.702611  1.044401
1 -1.942954  0.973792  0.763423
2 -0.650644  0.973792  0.908346
3  0.167938  0.973792 -1.574405
4  0.314763  0.973792 -1.574405
5 -1.893605  0.973792 -1.574405

In [32]:
df.fillna(method = 'ffill',limit = 3)

          0         1         2
0 -1.064044  0.702611  1.044401
1 -1.942954  0.973792  0.763423
2 -0.650644  0.973792  0.908346
3  0.167938  0.973792 -1.574405
4  0.314763  0.973792 -1.574405
5 -1.893605       NaN -1.574405

In [33]:
data = pd.Series([1.,NA,3.5,NA,7])

In [34]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [36]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],'k2':[1,1,2,3,3,4,4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data['v1'] = range(7)

In [40]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [43]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
data['animal'] = lowercased.map(meat_to_animal)

In [50]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [52]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data = pd.Series([1.,-999.,2,-999.,-1000.,3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999,-1000],NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999,-1000],[NA,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999:NA,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index = ['Ohio','Colorado','New York'],columns = ['one','two','three','four'])

In [60]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [61]:
transform = lambda x:x[:4].upper()

In [62]:
 data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform)

In [64]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [65]:
data.rename(index = str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [66]:
data.rename(index = {'OHIO':'INDIANA'},columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [67]:
data.rename(index = {'OHIO':'INDIANA'},inplace = True)

In [68]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [69]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [70]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [71]:
bins = [18,25,35,60,100]

In [72]:
cats = pd.cut(ages,bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [76]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [77]:
data = np.random.rand(20)

In [78]:
data

array([0.93084604, 0.60508244, 0.118452  , 0.69529061, 0.02803645,
       0.09753115, 0.71574407, 0.69564067, 0.47300976, 0.02925946,
       0.31581388, 0.09521781, 0.00573325, 0.88991515, 0.59888821,
       0.10624824, 0.2428312 , 0.70434434, 0.67727747, 0.79559978])

In [79]:
pd.cut(data,4)

[(0.7, 0.931], (0.468, 0.7], (0.00481, 0.237], (0.468, 0.7], (0.00481, 0.237], ..., (0.00481, 0.237], (0.237, 0.468], (0.7, 0.931], (0.468, 0.7], (0.7, 0.931]]
Length: 20
Categories (4, interval[float64]): [(0.00481, 0.237] < (0.237, 0.468] < (0.468, 0.7] < (0.7, 0.931]]

In [80]:
pd.cut(data,4,precision=2)

[(0.7, 0.93], (0.47, 0.7], (0.0048, 0.24], (0.47, 0.7], (0.0048, 0.24], ..., (0.0048, 0.24], (0.24, 0.47], (0.7, 0.93], (0.47, 0.7], (0.7, 0.93]]
Length: 20
Categories (4, interval[float64]): [(0.0048, 0.24] < (0.24, 0.47] < (0.47, 0.7] < (0.7, 0.93]]

In [81]:
data = np.random.randn(1000)

In [82]:
cats = pd.qcut(data,4)

In [83]:
cats

[(-0.0109, 0.696], (0.696, 3.012], (-3.4859999999999998, -0.686], (-3.4859999999999998, -0.686], (-0.0109, 0.696], ..., (0.696, 3.012], (-0.686, -0.0109], (-3.4859999999999998, -0.686], (-0.0109, 0.696], (0.696, 3.012]]
Length: 1000
Categories (4, interval[float64]): [(-3.4859999999999998, -0.686] < (-0.686, -0.0109] < (-0.0109, 0.696] < (0.696, 3.012]]

In [84]:
pd.value_counts(cats)

(-3.4859999999999998, -0.686]    250
(-0.686, -0.0109]                250
(-0.0109, 0.696]                 250
(0.696, 3.012]                   250
dtype: int64

In [85]:
qq = pd.qcut(data,[0,0.1,0.5,0.9,1])

In [86]:
pd.value_counts(qq)

(-1.34, -0.0109]                400
(-0.0109, 1.29]                 400
(-3.4859999999999998, -1.34]    100
(1.29, 3.012]                   100
dtype: int64

In [87]:
data = pd.DataFrame(np.random.randn(1000,4))

In [88]:
data

            0         1         2         3
0    0.573519 -0.119573 -0.552087 -0.229457
1    0.327115 -0.232842 -0.595907  0.524457
2   -1.886017  0.648997  0.480497  1.479000
3    0.735446  0.788900  1.293368  0.307733
4    0.373053 -0.789194  1.382401 -0.667969
..        ...       ...       ...       ...
995  0.116776  0.921601  0.811365 -0.441668
996 -0.682316  2.372836  0.288641  0.689808
997 -0.103669  0.435285 -0.178797 -0.084858
998 -1.569939  0.739023  0.159479  0.239474
999  0.654973  0.643847  0.649721  0.159085

[1000 rows x 4 columns]

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008085     0.005293     0.004109    -0.029502
std       1.026025     1.046016     0.991471     1.018394
min      -3.757460    -3.404114    -3.343600    -3.208786
25%      -0.700739    -0.718542    -0.641258    -0.682170
50%       0.033761    -0.038228     0.017964    -0.038263
75%       0.662521     0.720087     0.661187     0.648102
max       3.270643     2.924385     2.540515     3.376688

In [90]:
col = data[2]

In [91]:
col[np.abs(col) > 3]

342   -3.3436
Name: 2, dtype: float64

In [92]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
74   0.068268 -0.004394  0.212923  3.164885
119 -3.409610  0.399659 -1.229397  0.401041
174  0.282026 -3.106206  1.485055  0.081882
177  1.566741  0.756083  0.990944  3.376688
181 -3.046690  1.023353 -1.291755 -1.704815
258 -1.006284 -3.404114  0.105030 -0.125700
342 -2.072659 -0.679971 -3.343600  1.147484
384  3.229997  1.548739  0.269813  1.123956
441  3.270643  2.585190  1.038314 -0.496566
540 -3.000248  0.449906  1.067481 -0.033637
625 -3.757460 -0.584098 -1.512360 -0.565917
633 -1.181828  0.594309  0.218453 -3.208786

In [93]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [94]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [95]:
sampler = np.random.permutation(5)

In [96]:
sampler

array([3, 2, 4, 0, 1])

In [97]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

In [98]:
df.sample(3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [99]:
choices = pd.Series([5,7,-1,6,4])

In [100]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [101]:
draws = choices.sample(n = 10,replace = True)

In [102]:
draws

0    5
2   -1
0    5
1    7
3    6
1    7
4    4
1    7
1    7
4    4
dtype: int64

In [103]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [104]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [105]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [106]:
dummies = pd.get_dummies(df['key'],prefix = 'key')

In [107]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [108]:
df_with_dummy = df[['data1']].join(dummies)

In [109]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
mnames = ['movie_id','title','genres']

In [111]:
movies = pd.read_table(r'C:\Users\larryx30\Desktop\movies.dat',sep = '::',header = None,names = mnames)

<ipython-input-111-0c9ef136e3dd>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table(r'C:\Users\larryx30\Desktop\movies.dat',sep = '::',header = None,names = mnames)

In [112]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [113]:
all_genres = []

In [114]:
for x in movies.genres :
    all_genres.extend(x.split('|'))

In [115]:
genres = pd.unique(all_genres)

In [116]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [117]:
zero_matrix = np.zeros((len(movies),len(genres)))

In [118]:
dummies = pd.DataFrame(zero_matrix,columns = genres)

In [119]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [120]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [121]:
gen = movies.genres[0]

In [122]:
gen

"Animation|Children's|Comedy"

In [123]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [124]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [125]:
for i ,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [126]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [127]:
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [128]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [129]:
np.random.seed(12345)

In [130]:
values = np.random.rand(10)

In [131]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [132]:
val = 'a,b, guido'

In [133]:
val

'a,b, guido'

In [134]:
val.split(',')

['a', 'b', ' guido']

In [135]:
pieces = [x.strip() for x in val.split(',')]

In [136]:
pieces

['a', 'b', 'guido']

In [137]:
first,second,third = pieces

In [138]:
pieces

['a', 'b', 'guido']

In [139]:
first + '::' +second + '::' + third

'a::b::guido'

In [140]:
'::'.join(pieces)

'a::b::guido'

In [141]:
'guido' in val

True

In [142]:
val.index(',')

1

In [143]:
val.count(',')

2

In [144]:
val

'a,b, guido'

In [145]:
val.replace(',','::')

'a::b:: guido'

In [146]:
text = "foo    bar\t baz  \tqux"

In [147]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [148]:
regex = re.compile('\s+')

In [149]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [150]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [151]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [152]:
data = pd.Series(data)

In [153]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [154]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [155]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [156]:
data = pd.Series(np.random.randn(9),index = [['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [157]:
data

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [158]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [159]:
data['b']

1    0.228913
3    1.352917
dtype: float64

In [160]:
data['b':'c']

b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
dtype: float64

In [161]:
data.loc[['b','d']]

b  1    0.228913
   3    1.352917
d  2   -0.371843
   3    1.669025
dtype: float64

In [162]:
data.loc[:,2]

a   -1.296221
c   -2.001637
d   -0.371843
dtype: float64

In [163]:
data.unstack()

          1         2         3
a  1.007189 -1.296221  0.274992
b  0.228913       NaN  1.352917
c  0.886429 -2.001637       NaN
d       NaN -0.371843  1.669025

In [164]:
data.unstack().stack()

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [165]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),index = [['a','a','b','b'],[1,2,1,2]],columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [166]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [167]:
frame.index.names=['key1','key2']

In [168]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [169]:
frame.columns.names = ['state','color']

In [170]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [171]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [172]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [173]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [174]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [175]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [176]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [177]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [178]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [179]:
frame2 = frame.set_index(['c','d'],drop = False)

In [180]:
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [181]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

In [182]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [183]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [184]:
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [185]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [186]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [187]:
pd.merge(df1,df2,on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [188]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [189]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [190]:
df4 = pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [191]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [192]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [193]:
pd.merge(df1,df2,how= 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [194]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [195]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [196]:
df2 = pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [197]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [198]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [199]:
pd.merge(df1,df2,how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [200]:
left = pd.DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})

In [201]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [202]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [203]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [204]:
pd.merge(left,right,on = ['key1','key2'],how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [205]:
pd.merge(left,right,on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [206]:
pd.merge(left,right,on = 'key1',suffixes = ('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [207]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

In [208]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [209]:
right1 = pd.DataFrame({'group_val':[3.5,7]},index = ['a','b'])

In [210]:
right1

   group_val
a        3.5
b        7.0

In [211]:
pd.merge(left1,right1,left_on = 'key',right_index = True,how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [212]:
lefth = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})

In [213]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [214]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],[2001,2000,2000,2000,2001,2002]],columns = ['event1','event2'])

In [215]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [216]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index = True,how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [217]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],index = ['a','b','c'],columns = ['Ohio','Nevada'])

In [218]:
left2

   Ohio  Nevada
a   1.0     2.0
b   3.0     4.0
c   5.0     6.0

In [219]:
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],index = ['b','c','d','e'],columns = ['Missouri','Alabama'])

In [220]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [221]:
pd.merge(left2,right2,how = 'outer',left_index = True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [222]:
left2.join(right2,how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [223]:
left1.join(right1,on = 'key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [224]:
left2

   Ohio  Nevada
a   1.0     2.0
b   3.0     4.0
c   5.0     6.0

In [225]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [226]:
another = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],index = ['a','c','e','f'],columns = ['New York','Oregon'])

In [227]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [228]:
left2.join([right2,another],how = 'outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   3.0     4.0       7.0      8.0       NaN     NaN
c   5.0     6.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   NaN     NaN      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [229]:
arr = np.arange(12).reshape((3,4))

In [230]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [231]:
np.concatenate([arr,arr],axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [232]:
s1 = pd.Series([0,1],index = ['a','b'])

In [233]:
s1

a    0
b    1
dtype: int64

In [234]:
s2 = pd.Series([2,3,4],index = ['c','d','e'])

In [235]:
s3 = pd.Series([5,6],index = ['f','g'])

In [236]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [237]:
pd.concat([s1,s2,s3],axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [238]:
s4 = pd.concat([s1,s3])

In [239]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [240]:
pd.concat([s1,s4],axis = 1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [241]:
pd.concat([s1,s4],axis = 1,join = 'inner')

   0  1
a  0  0
b  1  1

In [242]:
pd.concat([s1,s2,s3],axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [243]:
pd.concat([s1,s2,s3],axis = 1,join = 'inner')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [244]:
result = pd.concat([s1,s1,s3],keys = ['one','two','three'])

In [245]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [246]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [247]:
pd.concat([s1,s2,s3],axis = 1,keys = ['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [248]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),index = ['a','b','c'],columns = ['one','two'])

In [249]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [250]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),index = ['a','c'],columns = ['three','four'])

In [251]:
df2

   three  four
a      5     6
c      7     8

In [252]:
pd.concat([df1,df2],axis = 1,keys = ['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [253]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [254]:
df2

   three  four
a      5     6
c      7     8

In [256]:
pd.concat({'level1':df1,'level2':df2},axis =1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [257]:
pd.concat([df1,df2],axis =1,keys = ['level1','level2'],names = ['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0